
**@flexwie suggests the following changes in this pull_request:**  

```terraform

Acquiring state lock. This may take a few moments...
hcloud_network.network: Refreshing state... [id=1253117]
hcloud_server.node1: Refreshing state... [id=15644423]
hcloud_network_subnet.subnet: Refreshing state... [id=1253117-10.0.1.0/24]
hcloud_server.db1: Refreshing state... [id=15653211]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_firewall.db_firewall will be created
  + resource "hcloud_firewall" "db_firewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "db_firewall"

      + apply_to {
          + label_selector = (known after apply)
          + server         = 15653211
        }

      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "6379"
          + protocol        = "tcp"
          + source_ips      = [
              + "10.0.1.0/24",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: iaac.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "iaac.tfplan"
Releasing state lock. This may take a few moments...

```

